cf/DataProcessors/ПодготовкаДанныхПФР2010.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ПодготовкаДанныхПФР2010</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПачкиСПВ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пачка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СведенияОВзносахИСтраховомСтажеСПВ1</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПачкиДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пачка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СведенияОТрудовомСтажеИЗаработкеСЗВ4</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаСЗВ4вПФР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчетныйПериод</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Пенсионеры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСоставления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПачкиСЗВ63</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пачка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СведенияОНачисленномЗаработкеСЗВ63</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/СведенияПринятыеПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияПринятыеПФР</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КомплектДокументов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПередачаСЗВ4вПФР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтчетныйПериодПерсучетаПФР</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/AccumulationRegisters/СтраховыеВзносыСведенияОДоходах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>СтраховыеВзносыСведенияОДоходах</Name>
			<Comment>(Регл)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоходыПоСтраховымВзносам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОблагаетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОблагаетсяПоДополнительномуТарифу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОблагаетсяВзносамиНаДоплатуКПенсииШахтерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/InformationRegisters/ПредельнаяВеличинаБазыСтраховыхВзносов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ПредельнаяВеличинаБазыСтраховыхВзносов</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/СведенияОбИнвалидностиФизлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбИнвалидностиФизлиц</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инвалидность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерияСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаИнвалидности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияСправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ГражданствоФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГражданствоФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаПенсию</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНеЯвляетсяНалоговымРезидентомРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаМедицинскоеСтрахование</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/ФорматФайлаПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ФорматФайлаПФР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Версия04</Name>
					<Comment>формат 04.00</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Версия07</Name>
					<Comment>Формат 07.00</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ТипыСведенийСЗВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыСведенийСЗВ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИСХОДНАЯ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПЕНСИОННАЯ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОРРЕКТИРУЮЩАЯ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОТМЕНЯЮЩАЯ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ТипДоговораСЗВ63.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипДоговораСЗВ63</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Трудовой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГражданскоПравовой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/ПодготовкаДанныхПФР2010/Ext/ObjectModule.bsl
// Хранит соответствие, при помощи которого храним и показываем содержимое пачки
Перем СоответствиеСсылокИОбъектов Экспорт;

Перем МассивПрошлыхПериодов Экспорт;

////////////////////////////////////////////////////////////////////////////////

// Процедура выводить сообщения в специальное окно сообщений
// тексты сообщений берутся из переменной МассивСообщений
//
Процедура ВывестиСообщенияОбОшибках(МассивСообщений) Экспорт
	
	Если МассивСообщений.Количество() > 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(,,"Подготовка данных для передачи в ПФР", СтатусСообщения.БезСтатуса);
		//ОбработкаКомментариев.ДобавитьСообщение("Подготовка данных для передачи в ПФР", СтатусСообщения.БезСтатуса);
		Для каждого ЭлементМассива Из МассивСообщений Цикл
			Если ЭлементМассива.РасшифровкаСообщения <> Неопределено И ЭлементМассива.РасшифровкаСообщения.Количество() > 1 Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ЭлементМассива.ТекстСообщения,,, ЭлементМассива.ВидСообщения);
				//РодительскаяСтрока = ОбработкаКомментариев.ДобавитьСообщение(ЭлементМассива.ТекстСообщения, ЭлементМассива.ВидСообщения);
				//Для Каждого ЭлементРасшифровки Из ЭлементМассива.РасшифровкаСообщения Цикл
				//	МассивРасшифровки = Новый Массив;
				//	МассивРасшифровки.Добавить(Новый Структура("Представление, Расшифровка", ЭлементРасшифровки.Представление, ЭлементРасшифровки.Расшифровка));
				//	ОбработкаКомментариев.ДобавитьСообщение("", СтатусСообщения.Информация, МассивРасшифровки, РодительскаяСтрока);
				//	
				//КонецЦикла;
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке(ЭлементМассива.ТекстСообщения);
				//ОбработкаКомментариев.ДобавитьСообщение(ЭлементМассива.ТекстСообщения, ЭлементМассива.ВидСообщения, ЭлементМассива.РасшифровкаСообщения);
			КонецЕсли
			
		КонецЦикла;
		//ОбработкаКомментариев.ПоказатьСообщения();
	КонецЕсли;	
	
КонецПроцедуры // ВывестиСообщенияОбОшибках()

// Создает структуру, с параметрами выводимого сообщения 
// для помещения в массив сообщений-структур
Функция СоздатьСообщениеСтруктуру(ТекстСообщения, ВидСообщения, РасшифровкаСообщения = Неопределено) Экспорт 
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТекстСообщения", ТекстСообщения);
	СтруктураСообщения.Вставить("ВидСообщения", ВидСообщения);
	СтруктураСообщения.Вставить("РасшифровкаСообщения", РасшифровкаСообщения);
	Возврат СтруктураСообщения
КонецФункции // СоздатьСообщениеСтруктуру()

////////////////////////////////////////////////////////////////////////////////

Процедура ЗаполнитьТаблицуДокументовАДВ() Экспорт 
	
	СоответствиеСсылокИОбъектов = Новый Соответствие;
	ПачкиДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачаСЗВ4вПФР.Ссылка,
	|	ПередачаСЗВ4вПФР.НомерПачки КАК НомерПачки,
	|	ПередачаСЗВ4вПФР.НеСодержитСЗВ КАК НеПоказыватьКадровику,
	|	ПередачаСЗВ4вПФР.ОтчетныйПериод
	|ИЗ
	|	Документ.ПередачаСЗВ4вПФР КАК ПередачаСЗВ4вПФР
	|ГДЕ
	|	ПередачаСЗВ4вПФР.Организация = &Организация
	|	И ПередачаСЗВ4вПФР.ОтчетныйПериод = &ОтчетныйПериод
	|	И (НЕ ПередачаСЗВ4вПФР.СпециальныйДокумент2010года)
	|	И (НЕ ПередачаСЗВ4вПФР.ПометкаУдаления)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.НомерПачки,
	|	ЛОЖЬ,
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод
	|ИЗ
	|	Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4 КАК СведенияОТрудовомСтажеИЗаработкеСЗВ4
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|		ПО СведенияОТрудовомСтажеИЗаработкеСЗВ4.Ссылка = ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка
	|ГДЕ
	|	СведенияОТрудовомСтажеИЗаработкеСЗВ4.Организация = &Организация
	|	И СведенияОТрудовомСтажеИЗаработкеСЗВ4.ОтчетныйПериод = &ОтчетныйПериод
	|	И (НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.СпециальныйДокумент2010года)
	|	И (НЕ СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПометкаУдаления)
	|	И ПередачаСЗВ4вПФРПачкиДокументов.Ссылка ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПачки";
	
	РаботаетНеРасчетчик = Ложь;
	
	МассивПачек = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если РаботаетНеРасчетчик И Выборка.НеПоказыватьКадровику Тогда
			Продолжить;
		КонецЕсли;
		СтрокаПачки = ПачкиДокументов.Добавить();
		СтрокаПачки.Пачка			= Выборка.Ссылка;
		СтрокаПачки.ОтчетныйПериод	= Выборка.ОтчетныйПериод;
		МассивПачек.Добавить(Выборка.Ссылка);
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ПередачаСЗВ4ВПФР") Тогда
			ПустыеСтроки = ДокументОбъект.ПачкиДокументов.НайтиСтроки(Новый Структура("ДокументПачка", Документы.СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПустаяСсылка()));
			Если ПустыеСтроки.Количество() > 0 Тогда
				Для каждого СтрокаДокумента Из ПустыеСтроки Цикл
					ДокументОбъект.ПачкиДокументов.Удалить(СтрокаДокумента);
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		СоответствиеСсылокИОбъектов.Вставить(Выборка.Ссылка,ДокументОбъект);
	КонецЦикла;
	
	МассивПрошлыхПериодов = Новый Массив;
	Если Не РаботаетНеРасчетчик Тогда
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СведенияПринятыеПФР.КомплектДокументов КАК Пачка,
		|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР КАК ОтчетныйПериод
		|ИЗ
		|	РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
		|ГДЕ
		|	СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
		|	И СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4ВПФР.ПустаяСсылка)
		|	И СведенияПринятыеПФР.Организация = &Организация
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетныйПериод УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ПачкиДокументов.Добавить(), Выборка);
			МассивПачек.Добавить(Выборка.Пачка);
			СоответствиеСсылокИОбъектов.Вставить(Выборка.Пачка, Выборка.Пачка.ПолучитьОбъект());
		КонецЦикла;
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("ОтчетныйПериод",	ОтчетныйПериод);
		Запрос.УстановитьПараметр("ДатаЗаменыЕСН", ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами());
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МИНИМУМ(Данные.ОтчетныйПериодПерсучетаПФР) КАК ОтчетныйПериодПерсучетаПФР
		|ИЗ
		|	(ВЫБРАТЬ
		|		СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР КАК ОтчетныйПериодПерсучетаПФР
		|	ИЗ
		|		РегистрСведений.СведенияПринятыеПФР КАК СведенияПринятыеПФР
		|	ГДЕ
		|		СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР < &ОтчетныйПериод
		|		И СведенияПринятыеПФР.Организация = &Организация
		|		И СведенияПринятыеПФР.ОтчетныйПериодПерсучетаПФР >= &ДатаЗаменыЕСН
		|		И СведенияПринятыеПФР.КомплектДокументов <> ЗНАЧЕНИЕ(Документ.ПередачаСЗВ4ВПФР.ПустаяСсылка)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ВЫБОР
		|			КОГДА СтраховыеВзносыСведенияОДоходах.Период < ДАТАВРЕМЯ(2010, 7, 1)
		|				ТОГДА НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, ГОД)
		|			КОГДА СтраховыеВзносыСведенияОДоходах.Период < ДАТАВРЕМЯ(2011, 1, 1)
		|				ТОГДА ДАТАВРЕМЯ(2010, 7, 1)
		|			ИНАЧЕ НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, КВАРТАЛ)
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.СтраховыеВзносыСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
		|	ГДЕ
		|		СтраховыеВзносыСведенияОДоходах.Период >= &ДатаЗаменыЕСН
		|		И СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение = &Организация
		|		И СтраховыеВзносыСведенияОДоходах.Период < &ОтчетныйПериод) КАК Данные";
		
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			МассивПрошлыхПериодов = Новый Массив;
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			РасчетныйПериод = Выборка.ОтчетныйПериодПерсучетаПФР;
			Если РасчетныйПериод <> Null Тогда
				Пока РасчетныйПериод < ОтчетныйПериод Цикл
					МассивПрошлыхПериодов.Добавить(РасчетныйПериод);
					Если Год(РасчетныйПериод) < 2011 Тогда
						РасчетныйПериод = ДобавитьМесяц(РасчетныйПериод, 6);
					Иначе
						РасчетныйПериод = ДобавитьМесяц(РасчетныйПериод, 3);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПачкиАДВ", МассивПачек);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка КАК Ссылка
	|ИЗ
	|	Документ.ПередачаСЗВ4вПФР.ПачкиДокументов КАК ПередачаСЗВ4вПФРПачкиДокументов
	|ГДЕ
	|	ПередачаСЗВ4вПФРПачкиДокументов.Ссылка В(&ПачкиАДВ)
	|	И ПередачаСЗВ4вПФРПачкиДокументов.ДокументПачка <> ЗНАЧЕНИЕ(Документ.СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеСсылокИОбъектов.Вставить(Выборка.Ссылка,Выборка.Ссылка.ПолучитьОбъект()) 
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуДокументовАДВ()

Процедура ЗаполнитьТаблицуДокументовСПВ() Экспорт 
	
	СоответствиеСсылокИОбъектов = Новый Соответствие;
	ПачкиСПВ.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйПериод);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОВзносахИСтраховомСтажеСПВ1.Ссылка,
	|	СведенияОВзносахИСтраховомСтажеСПВ1.НомерПачки КАК НомерПачки
	|ИЗ
	|	Документ.СведенияОВзносахИСтраховомСтажеСПВ1 КАК СведенияОВзносахИСтраховомСтажеСПВ1
	|ГДЕ
	|	СведенияОВзносахИСтраховомСтажеСПВ1.Организация = &Организация
	|	И СведенияОВзносахИСтраховомСтажеСПВ1.ОтчетныйПериод = &ОтчетныйПериод
	|	И (НЕ СведенияОВзносахИСтраховомСтажеСПВ1.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПачки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПачкиСПВ.Добавить().Пачка = Выборка.Ссылка;
		СоответствиеСсылокИОбъектов.Вставить(Выборка.Ссылка,Выборка.Ссылка.ПолучитьОбъект()) 
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуДокументовАДВ()

Процедура ЗаполнитьТаблицуДокументовСЗВ63() Экспорт 
	
	СоответствиеСсылокИОбъектов = Новый Соответствие;
	ПачкиСЗВ63.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтчетныйПериод", ОтчетныйГод);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СведенияОНачисленномЗаработкеСЗВ63.Ссылка,
	|	СведенияОНачисленномЗаработкеСЗВ63.НомерПачки КАК НомерПачки
	|ИЗ
	|	Документ.СведенияОНачисленномЗаработкеСЗВ63 КАК СведенияОНачисленномЗаработкеСЗВ63
	|ГДЕ
	|	СведенияОНачисленномЗаработкеСЗВ63.Организация = &Организация
	|	И СведенияОНачисленномЗаработкеСЗВ63.ОтчетныйПериод = &ОтчетныйПериод
	|	И (НЕ СведенияОНачисленномЗаработкеСЗВ63.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерПачки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПачкиСЗВ63.Добавить().Пачка = Выборка.Ссылка;
		СоответствиеСсылокИОбъектов.Вставить(Выборка.Ссылка,Выборка.Ссылка.ПолучитьОбъект()) 
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьТаблицуДокументовАДВ()

////////////////////////////////////////////////////////////////////////////////

// Получает значения общих для всех видов документов реквизитов
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Структура, содержащая значения реквизитов
//
Функция СтруктураОбщихРеквизитовДокумента()
	
	СтруктураРеквизитов = Новый Структура("Организация,ОтчетныйПериод,ФорматФайла,Ответственный,Руководитель,ДолжностьРуководителя,Дата");
	СтруктураРеквизитов.Дата = ОбщегоНазначения.ПолучитьРабочуюДату(); 
	СтруктураРеквизитов.Организация = Организация;
	СтруктураРеквизитов.ОтчетныйПериод = ОтчетныйПериод;
	СтруктураРеквизитов.ФорматФайла = Перечисления.ФорматФайлаПФР.Версия07;
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ПроцедурыПерсонифицированногоУчета.ДанныеРуководителяОрганизации(Организация, СтруктураРеквизитов.Дата));
	СтруктураРеквизитов.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
	Если СтруктураРеквизитов.Ответственный.Пустая() Тогда
		СтруктураРеквизитов.Ответственный = глЗначениеПеременной("глТекущийПользователь")
	КонецЕсли;
	
    Возврат СтруктураРеквизитов
	
КонецФункции // СтруктураОбщихРеквизитовДокумента()

////////////////////////////////////////////////////////////////////////////////

Функция СоздатьАДВ(ЭтоАДВ11 = Ложь, СтруктураРеквизитов = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.ПередачаСЗВ4вПФР.СоздатьДокумент();
   	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.НеСодержитСЗВ = ЭтоАДВ11;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.ПередачаСЗВ4вПФР.ПолучитьСсылку());
	Если ЭтоАДВ11 Тогда
		ДокОбъект.АвтозаполнениеСтрокЗадолженности();
	КонецЕсли;
	
	СтрокаПачки = ПачкиДокументов.Добавить();
	СтрокаПачки.Пачка = ДокОбъект.ПолучитьСсылкуНового();
	СтрокаПачки.ОтчетныйПериод	= ДокОбъект.ОтчетныйПериод;
	СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
	Если ИзменятьПозициюСтроки Тогда
		ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции // СоздатьАДВ()

Функция СоздатьСЗВ6(ВСоставеОписи = Истина, ДокументОбъектАДВ11 = Неопределено, СтруктураРеквизитов = Неопределено, КатегорияЗастрахованныхЛиц = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.СведенияОТрудовомСтажеИЗаработкеСЗВ4.СоздатьДокумент();
   	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ;
	ДокОбъект.ТипФормДокументов = "СЗВ-6-2";
	ДокОбъект.КатегорияЗастрахованныхЛиц = КатегорияЗастрахованныхЛиц;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.СведенияОТрудовомСтажеИЗаработкеСЗВ4.ПолучитьСсылку());
	
	Если ВСоставеОписи Тогда
		СтрокаПачки = ДокументОбъектАДВ11.ПачкиДокументов.Добавить();
		СтрокаПачки.ДокументПачка = ДокОбъект.ПолучитьСсылкуНового();
		СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.ДокументПачка, ДокОбъект);
		Если ИзменятьПозициюСтроки Тогда
			ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
		КонецЕсли;
	Иначе
		СтрокаПачки = ПачкиДокументов.Добавить();
		СтрокаПачки.Пачка = ДокОбъект.ПолучитьСсылкуНового();
		СтрокаПачки.ОтчетныйПериод	= ДокОбъект.ОтчетныйПериод;
		СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
		Если ИзменятьПозициюСтроки Тогда
			ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции

Функция СоздатьСПВ(СтруктураРеквизитов = Неопределено, КатегорияЗастрахованныхЛиц = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.СведенияОВзносахИСтраховомСтажеСПВ1.СоздатьДокумент();
   	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ;
	ДокОбъект.КатегорияЗастрахованныхЛиц = КатегорияЗастрахованныхЛиц;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.СведенияОВзносахИСтраховомСтажеСПВ1.ПолучитьСсылку());
	
	СтрокаПачки = ПачкиСПВ.Добавить();
	СтрокаПачки.Пачка = ДокОбъект.ПолучитьСсылкуНового();
	СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
	Если ИзменятьПозициюСтроки Тогда
		ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции

Функция СоздатьСЗВ63(СтруктураРеквизитов = Неопределено, КатегорияЗастрахованныхЛиц = Неопределено, ИзменятьПозициюСтроки = Ложь, ТабличноеПоле = Неопределено) Экспорт
	
	Если СтруктураРеквизитов = Неопределено Тогда
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
	КонецЕсли;
	
	ДокОбъект = Документы.СведенияОНачисленномЗаработкеСЗВ63.СоздатьДокумент();
   	ЗаполнитьЗначенияСвойств(ДокОбъект, СтруктураРеквизитов);
	ДокОбъект.ТипСведенийСЗВ = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ;
	ДокОбъект.ТипДоговора = Перечисления.ТипДоговораСЗВ63.Трудовой;
	ДокОбъект.ОтчетныйПериод = ОтчетныйГод;
	ДокОбъект.КатегорияЗастрахованныхЛиц = КатегорияЗастрахованныхЛиц;
	ПроцедурыПерсонифицированногоУчета.ПроставитьНомерПачки(ДокОбъект);
	ДокОбъект.УстановитьНовыйНомер();
	ДокОбъект.УстановитьСсылкуНового(Документы.СведенияОНачисленномЗаработкеСЗВ63.ПолучитьСсылку());
	
	СтрокаПачки = ПачкиСЗВ63.Добавить();
	СтрокаПачки.Пачка = ДокОбъект.ПолучитьСсылкуНового();
	СоответствиеСсылокИОбъектов.Вставить(СтрокаПачки.Пачка, ДокОбъект);
	Если ИзменятьПозициюСтроки Тогда
		ТабличноеПоле.ТекущаяСтрока = СтрокаПачки;
	КонецЕсли;
	
	Возврат ДокОбъект
	
КонецФункции

Функция АвтозаполнениеПачек(ТипСведений) Экспорт
	
	ТекущаяСтрока = Неопределено;
	
	ДатаСозданияДокументов = ОбщегоНазначения.ПолучитьРабочуюДату();
	
	// информация об ошибках
	МассивСообщений = Новый Массив;
	СписокФизЛицБезСтрахНомеров = Новый СписокЗначений;
	
	Если ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Или ТипСведений = Перечисления.ТипыСведенийСЗВ.ПЕНСИОННАЯ Тогда
		
		ТаблицаСтажа = ПроцедурыПерсонифицированногоУчета.ДанныеОСтажеИВзносах(ДатаСозданияДокументов, ОтчетныйПериод, Организация, ?(ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ, Неопределено, Пенсионеры.ВыгрузитьКолонку("ФизЛицо"))); 
		
		Если ТаблицаСтажа.Количество() > 0 Тогда
			
			Если ДатаСозданияДокументов < НачалоДня(ПроцедурыПерсонифицированногоУчета.ОкончаниеОтчетногоПериодаПерсучета(ОтчетныйПериод)) Тогда
				МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("При расчете сумм уплаченных взносов учтены данные, зарегистрированные по " + Формат(ДатаСозданияДокументов,"ДЛФ=DD"), СтатусСообщения.Важное));
			КонецЕсли;
			
			СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
			
			Если ТипСведений = Перечисления.ТипыСведенийСЗВ.ИСХОДНАЯ Тогда
				
				ОбъектАДВ62 = СоздатьАДВ(Ложь, СтруктураРеквизитов);
				ТекущаяСтрока = ПачкиДокументов[ПачкиДокументов.Количество() - 1];
				
				ТипФормДокументов = "";
				КатегорияЗЛ = "";
				ЛьготыПоУсловиямТруда = "";
				ЛьготыПоВыслуге = "";
				НовыйДок = Неопределено;
				
				Для каждого СтрокаТЗ Из ТаблицаСтажа Цикл
					
					Если ТипФормДокументов <> СтрокаТЗ.ТипФормДокументов Или ЛьготыПоУсловиямТруда <> СтрокаТЗ.ЛьготыПоУсловиямТруда Или ЛьготыПоВыслуге <> СтрокаТЗ.ЛьготыПоВыслуге Или КатегорияЗЛ <> СтрокаТЗ.КатегорияЗастрахованныхЛиц Тогда
						
						Если НовыйДок = Неопределено Или НовыйДок.РаботникиОрганизации.Количество() <> 0 Тогда
							НовыйДок = СоздатьСЗВ6(Истина, ОбъектАДВ62, СтруктураРеквизитов);
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"ТипФормДокументов, КатегорияЗастрахованныхЛиц");
						
						ТипФормДокументов = СтрокаТЗ.ТипФормДокументов;
						КатегорияЗЛ = СтрокаТЗ.КатегорияЗастрахованныхЛиц;
						ЛьготыПоУсловиямТруда = СтрокаТЗ.ЛьготыПоУсловиямТруда;
						ЛьготыПоВыслуге = СтрокаТЗ.ЛьготыПоВыслуге;
						
					КонецЕсли;
					
					// Если у физлица нет страхового номера, то в пачки его включать не будем: проверка на указание пустого или неверного страхового номера ("   -   -      ")
					Если СтрокаТЗ.НетСтраховогоНомера Тогда
						СписокФизЛицБезСтрахНомеров.Добавить(СтрокаТЗ.ФизЛицо, СтрокаТЗ.Наименование);
						Продолжить;
					КонецЕсли;	
					
					Если НовыйДок.РаботникиОрганизации.Количество() = 200 Тогда
						
						НовыйДок = СоздатьСЗВ6(Истина, ОбъектАДВ62, СтруктураРеквизитов);
						ЗаполнитьЗначенияСвойств(НовыйДок,СтрокаТЗ,"ТипФормДокументов, КатегорияЗастрахованныхЛиц");
						
					КонецЕсли; 
					
					СтрокаТабличнойЧасти = НовыйДок.РаботникиОрганизации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаТЗ);
					Фамилия = СтрокаТЗ.Фамилия;
					Имя = СтрокаТЗ.Имя;
					Отчество = СтрокаТЗ.Отчество;
					Если Не ЗначениеЗаполнено(Фамилия + Имя + Отчество) Тогда
						ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрокаТЗ.Наименование,Фамилия,Имя,Отчество);
					КонецЕсли;
					СтрокаТабличнойЧасти.Фамилия = Фамилия;
					СтрокаТабличнойЧасти.Имя = Имя;
					СтрокаТабличнойЧасти.Отчество = Отчество;
					
				КонецЦикла;
				
			Иначе
				
				КатегорияЗЛ = ТаблицаСтажа[0].КатегорияЗастрахованныхЛиц;
				НовыйДок = СоздатьСПВ(СтруктураРеквизитов, КатегорияЗЛ);
				ТекущаяСтрока = ПачкиСПВ[ПачкиСПВ.Количество() - 1];
				
				Для каждого СтрокаТЗ Из ТаблицаСтажа Цикл
					
					Если КатегорияЗЛ <> СтрокаТЗ.КатегорияЗастрахованныхЛиц Тогда
						
						Если НовыйДок.РаботникиОрганизации.Количество() <> 0 Тогда
							НовыйДок.РассчитатьВзносы();
							НовыйДок = СоздатьСПВ(СтруктураРеквизитов, СтрокаТЗ.КатегорияЗастрахованныхЛиц);
						КонецЕсли;
						
						КатегорияЗЛ = СтрокаТЗ.КатегорияЗастрахованныхЛиц;
						
					КонецЕсли;
					
					// Если у физлица нет страхового номера, то в пачки его включать не будем: проверка на указание пустого или неверного страхового номера ("   -   -      ")
					Если СтрокаТЗ.НетСтраховогоНомера Тогда
						СписокФизЛицБезСтрахНомеров.Добавить(СтрокаТЗ.ФизЛицо, СтрокаТЗ.Наименование);
						Продолжить;
					КонецЕсли;	
					
					Если НовыйДок.РаботникиОрганизации.Количество() = 200 Тогда
						
						НовыйДок.РассчитатьВзносы();
						НовыйДок = СоздатьСПВ(СтруктураРеквизитов, СтрокаТЗ.КатегорияЗастрахованныхЛиц);
						
					КонецЕсли; 
					
					СтрокаТабличнойЧасти = НовыйДок.РаботникиОрганизации.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти,СтрокаТЗ);
					Фамилия = СтрокаТЗ.Фамилия;
					Имя = СтрокаТЗ.Имя;
					Отчество = СтрокаТЗ.Отчество;
					Если Не ЗначениеЗаполнено(Фамилия + Имя + Отчество) Тогда
						ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрокаТЗ.Наименование,Фамилия,Имя,Отчество);
					КонецЕсли;
					СтрокаТабличнойЧасти.Фамилия = Фамилия;
					СтрокаТабличнойЧасти.Имя = Имя;
					СтрокаТабличнойЧасти.Отчество = Отчество;
					СтрокаПенсионера = Пенсионеры.Найти(СтрокаТабличнойЧасти.ФизЛицо,"ФизЛицо");
					Если СтрокаПенсионера <> Неопределено Тогда
						СтрокаТабличнойЧасти.ДатаСоставления = СтрокаПенсионера.ДатаСоставления
					КонецЕсли;
					
				КонецЦикла;
				
				НовыйДок.РассчитатьВзносы();
				
			КонецЕсли;
			
		Иначе
			МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("По организации " + ОбщегоНазначения.ПолучитьЗначениеРеквизита(Организация,"Наименование") + " не обнаружено сведений о стаже и взносах!", СтатусСообщения.ОченьВажное));
		КонецЕсли;
		
	Иначе
		
		ДатаС = Дата(ОтчетныйГод, 1, 1);
		ДатаПо = Мин(ДатаСозданияДокументов,КонецГода(ДатаС));
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ПроцедурыПерсонифицированногоУчета.ПоместитьВМенеджерСоответствиеТарифаКатегории(Запрос.МенеджерВременныхТаблиц);
		Запрос.УстановитьПараметр("ГоловнаяОрганизация", ОбщегоНазначения.ГоловнаяОрганизация(Организация));
		Запрос.УстановитьПараметр("ОбособленноеПодразделение", Организация);
		Запрос.УстановитьПараметр("Начало", ДатаС);
		Запрос.УстановитьПараметр("Окончание", ДатаПо);
		Запрос.УстановитьПараметр("ДатаАктуальности", ДатаСозданияДокументов);
		Запрос.УстановитьПараметр("ДатаНовойРедакцииЗакона212", ПроведениеРасчетов.ДатаРасширенияПеречняЛьготныхТарифовСтраховыхВзносов());
		
		МассивВидовДохода = Новый Массив;
		Если ОтчетныйГод < Год(ПроведениеРасчетов.ДатаЗаменыЕСНСтраховымиВзносами()) Тогда
			МассивВидовДохода.Добавить(Справочники.ДоходыЕСН.ПособияЗаСчетФСС);
			МассивВидовДохода.Добавить(Справочники.ДоходыЕСН.ДенежноеДовольствиеВоеннослужащих);
			МассивВидовДохода.Добавить(Справочники.ДоходыЕСН.ДенежноеСодержаниеПрокуроров);
			МассивВидовДохода.Добавить(Справочники.ДоходыЕСН.НеОблагаетсяЦеликом);
			МассивВидовДохода.Добавить(Справочники.ДоходыЕСН.ОблагаетсяЦеликом);
			МассивВидовДохода.Добавить(Справочники.ДоходыЕСН.МатпомощьПриРожденииРебенка);
			МассивВидовДохода.Добавить(Справочники.ДоходыЕСН.Матпомощь);
			МассивВидовДохода.Добавить(Справочники.ДоходыЕСН.ВыплатыЗаСчетПрибыли);
		Иначе
			МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ПособияЗаСчетФСС);
			МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ДенежноеДовольствиеВоеннослужащих);
			МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ДенежноеСодержаниеПрокуроров);
			МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ДоходыСтудентовЗаРаботуВСтудотрядеПоТрудовомуДоговору);
			МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.НеОблагаетсяЦеликом);
			МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.ОблагаетсяЦеликом);
			МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.МатпомощьПриРожденииРебенка);
			МассивВидовДохода.Добавить(Справочники.ДоходыПоСтраховымВзносам.Матпомощь);
		КонецЕсли;
		Запрос.УстановитьПараметр("ВидыДохода", МассивВидовДохода);
		ДтНачМесяца = ДатаС;
		ТекстПериодов = "ВЫБРАТЬ
		|	&Начало КАК Период
		|ПОМЕСТИТЬ ВТПериоды";
		ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
		Пока ДтНачМесяца <= ДатаПо Цикл
			ТекстПериодов =  ТекстПериодов + "
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ
			|	ДАТАВРЕМЯ("+Формат(ДтНачМесяца, "ДФ=yyyy")+", "+Месяц(ДтНачМесяца)+", 1) КАК Период
			|";
			ДтНачМесяца = ДобавитьМесяц(ДтНачМесяца, 1);
		КонецЦИкла;
		Запрос.Текст = ТекстПериодов;
		Запрос.Выполнить();
		ОсновнойТекст = 
		"ВЫБРАТЬ
		|	ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних.Размер КАК Размер
		|ПОМЕСТИТЬ ВТПредельнаяВеличина
		|ИЗ
		|	РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов.СрезПоследних(&Окончание, ) КАК ПредельнаяВеличинаБазыСтраховыхВзносовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Периоды.Период КАК Период,
		|	ЕСТЬNULL(УчетнаяПолитикаНалоговыйУчет.ВидТарифаСтраховыхВзносов, ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОбщийНалоговыйРежим)) КАК ВидТарифаСтраховыхВзносов
		|ПОМЕСТИТЬ ВТТарифыОрганизации
		|ИЗ
		|	(ВЫБРАТЬ
		|		Периоды.Период КАК Период,
		|		УчетнаяПолитикаНалоговыйУчет.Организация КАК Организация,
		|		МАКСИМУМ(УчетнаяПолитикаНалоговыйУчет.Период) КАК ПериодРегистра
		|	ИЗ
		|		ВТПериоды КАК Периоды
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
		|			ПО Периоды.Период >= УчетнаяПолитикаНалоговыйУчет.Период
		|				И (УчетнаяПолитикаНалоговыйУчет.Организация = &ГоловнаяОрганизация)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Периоды.Период,
		|		УчетнаяПолитикаНалоговыйУчет.Организация) КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаНалоговыйУчет КАК УчетнаяПолитикаНалоговыйУчет
		|		ПО Периоды.ПериодРегистра = УчетнаяПолитикаНалоговыйУчет.Период
		|			И Периоды.Организация = УчетнаяПолитикаНалоговыйУчет.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТФизлица
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
		|			&Начало,
		|			&Окончание,
		|			МЕСЯЦ,
		|			ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|				И Организация = &ГоловнаяОрганизация
		|				И ОбособленноеПодразделение = &ОбособленноеПодразделение) КАК СтраховыеВзносыСведенияОДоходах
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФИОФизЛицСрезПоследних.ФизЛицо КАК ФизЛицо,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество
		|ПОМЕСТИТЬ ВТФИО
		|ИЗ
		|	РегистрСведений.ФИОФизЛиц.СрезПоследних(
		|			&ДатаАктуальности,
		|			ФизЛицо В
		|				(ВЫБРАТЬ
		|					Лица.ФизЛицо КАК ФизЛицо
		|				ИЗ
		|					ВТФизлица КАК Лица)) КАК ФИОФизЛицСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезПоследнихДат.ПериодРегистрации КАК ПериодРегистрации,
		|	СрезПоследнихДат.Физлицо КАК Физлицо,
		|	СведенияОбИнвалидностиФизлиц.Инвалидность
		|ПОМЕСТИТЬ ВТИнвалиды
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТПериоды.Период КАК ПериодРегистрации,
		|		СведенияОбИнвалидностиФизлиц.Физлицо КАК Физлицо,
		|		МАКСИМУМ(СведенияОбИнвалидностиФизлиц.Период) КАК Период
		|	ИЗ
		|		ВТПериоды КАК ВТПериоды
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
		|			ПО (КОНЕЦПЕРИОДА(ВТПериоды.Период, МЕСЯЦ) >= СведенияОбИнвалидностиФизлиц.Период)
		|	ГДЕ
		|		СведенияОбИнвалидностиФизлиц.Физлицо В
		|				(ВЫБРАТЬ
		|					Лица.ФизЛицо КАК ФизЛицо
		|				ИЗ
		|					ВТФизлица КАК Лица)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОбИнвалидностиФизлиц.Физлицо,
		|		ВТПериоды.Период) КАК СрезПоследнихДат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизлиц КАК СведенияОбИнвалидностиФизлиц
		|		ПО СрезПоследнихДат.Период = СведенияОбИнвалидностиФизлиц.Период
		|			И СрезПоследнихДат.Физлицо = СведенияОбИнвалидностиФизлиц.Физлицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СрезПоследнихДат.ПериодРегистрации КАК ПериодРегистрации,
		|	СрезПоследнихДат.Физлицо КАК Физлицо,
		|	ГражданствоФизЛиц.НеИмеетПравоНаПенсию
		|ПОМЕСТИТЬ ВТГражданство
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТПериоды.Период КАК ПериодРегистрации,
		|		ГражданствоФизЛиц.ФизЛицо КАК Физлицо,
		|		МАКСИМУМ(ГражданствоФизЛиц.Период) КАК Период
		|	ИЗ
		|		ВТПериоды КАК ВТПериоды
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
		|			ПО (КОНЕЦПЕРИОДА(ВТПериоды.Период, МЕСЯЦ) >= ГражданствоФизЛиц.Период)
		|	ГДЕ
		|		ГражданствоФизЛиц.ФизЛицо В
		|				(ВЫБРАТЬ
		|					Лица.ФизЛицо КАК ФизЛицо
		|				ИЗ
		|					ВТФизлица КАК Лица)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ГражданствоФизЛиц.ФизЛицо,
		|		ВТПериоды.Период) КАК СрезПоследнихДат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГражданствоФизЛиц КАК ГражданствоФизЛиц
		|		ПО СрезПоследнихДат.Период = ГражданствоФизЛиц.Период
		|			И СрезПоследнихДат.Физлицо = ГражданствоФизЛиц.ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|	СтраховыеВзносыСведенияОДоходах.Организация,
		|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
		|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
		|	ВЫБОР
		|		КОГДА СтраховыеВзносыСведенияОДоходах.Период < &ДатаНовойРедакцииЗакона212
		|			ТОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОблагаетсяЕНВД,
		|	СтраховыеВзносыСведенияОДоходах.Период КАК Период,
		|	СУММА(СтраховыеВзносыСведенияОДоходах.РезультатОборот) КАК РезультатОборот,
		|	СУММА(СтраховыеВзносыСведенияОДоходах.СкидкаОборот) КАК СкидкаОборот
		|ПОМЕСТИТЬ ВТСведенияОДоходах
		|ИЗ
		|	РегистрНакопления.СтраховыеВзносыСведенияОДоходах.Обороты(
		|			&Начало,
		|			&Окончание,
		|			МЕСЯЦ,
		|			Физлицо В
		|					(ВЫБРАТЬ
		|						Лица.ФизЛицо КАК ФизЛицо
		|					ИЗ
		|						ВТФизлица КАК Лица)
		|				И ВидДохода <> ЗНАЧЕНИЕ(Справочник.ДоходыПоСтраховымВзносам.НеЯвляетсяОбъектом)
		|				И Организация = &ГоловнаяОрганизация) КАК СтраховыеВзносыСведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СтраховыеВзносыСведенияОДоходах.ФизЛицо,
		|	СтраховыеВзносыСведенияОДоходах.Организация,
		|	СтраховыеВзносыСведенияОДоходах.ВидДохода,
		|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение,
		|	СтраховыеВзносыСведенияОДоходах.Период,
		|	ВЫБОР
		|		КОГДА СтраховыеВзносыСведенияОДоходах.Период < &ДатаНовойРедакцииЗакона212
		|			ТОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо
		|ПОМЕСТИТЬ ВТФизлицаБезОблагаемойБазы
		|ИЗ
		|	ВТСведенияОДоходах КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизЛицо
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА СведенияОДоходах.ВидДохода.ВходитВБазуПФР
		|					ИЛИ СведенияОДоходах.ВидДохода.ВходитВБазуФОМС
		|				ТОГДА СведенияОДоходах.РезультатОборот - СведенияОДоходах.СкидкаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) < 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтраховыеВзносыСведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|	НАЧАЛОПЕРИОДА(СтраховыеВзносыСведенияОДоходах.Период, МЕСЯЦ) КАК ПериодРегистрации,
		|	СтраховыеВзносыСведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	ВЫБОР
		|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода В (&ВидыДохода)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.Трудовой)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипДоговораСЗВ63.ГражданскоПравовой)
		|	КОНЕЦ КАК ТипДоговора,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Инвалиды.Инвалидность, ЛОЖЬ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ОрганизацияИнвалидов)
		|		КОГДА СтраховыеВзносыСведенияОДоходах.ОблагаетсяЕНВД
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТарифыСтраховыхВзносов.ЕНВД)
		|		ИНАЧЕ ВидыТарифныхСтавок.ВидТарифаСтраховыхВзносов
		|	КОНЕЦ КАК ВидТарифаСтраховыхВзносов,
		|	СтраховыеВзносыСведенияОДоходах.РезультатОборот КАК Результат,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(Гражданство.НеИмеетПравоНаПенсию, ЛОЖЬ)
		|			ТОГДА 0
		|		КОГДА СтраховыеВзносыСведенияОДоходах.ВидДохода.ВходитВБазуПФР
		|			ТОГДА СтраховыеВзносыСведенияОДоходах.РезультатОборот - СтраховыеВзносыСведенияОДоходах.СкидкаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОблагаемаяБазаПФР
		|ПОМЕСТИТЬ ВТДоходыПоТарифам
		|ИЗ
		|	ВТСведенияОДоходах КАК СтраховыеВзносыСведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнвалиды КАК Инвалиды
		|		ПО СтраховыеВзносыСведенияОДоходах.Период = Инвалиды.ПериодРегистрации
		|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Инвалиды.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТГражданство КАК Гражданство
		|		ПО СтраховыеВзносыСведенияОДоходах.Период = Гражданство.ПериодРегистрации
		|			И СтраховыеВзносыСведенияОДоходах.ФизЛицо = Гражданство.Физлицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТарифыОрганизации КАК ВидыТарифныхСтавок
		|		ПО СтраховыеВзносыСведенияОДоходах.Период = ВидыТарифныхСтавок.Период
		|ГДЕ
		|	(НЕ СтраховыеВзносыСведенияОДоходах.ФизЛицо В
		|				(ВЫБРАТЬ
		|					Физлица.ФизЛицо
		|				ИЗ
		|					ВТФизлицаБезОблагаемойБазы КАК Физлица))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|	НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) КАК Период,
		|	СУММА(СведенияОДоходах.ОблагаемаяБазаПФР) КАК ЗаГод,
		|	СУММА(ВЫБОР
		|			КОГДА НАЧАЛОПЕРИОДА(Периоды.Период, МЕСЯЦ) = СведенияОДоходах.ПериодРегистрации
		|				ТОГДА СведенияОДоходах.ОблагаемаяБазаПФР
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЗаМесяц
		|ПОМЕСТИТЬ ВТБазаНарастающимИтогом
		|ИЗ
		|	ВТПериоды КАК Периоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДоходыПоТарифам КАК СведенияОДоходах
		|		ПО (СведенияОДоходах.ПериодРегистрации МЕЖДУ НАЧАЛОПЕРИОДА(Периоды.Период, ГОД) И Периоды.Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизЛицо,
		|	Периоды.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
		|	ОблагаемаяБаза.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер >= 0
		|			ТОГДА ОблагаемаяБаза.ЗаГод - Предел.Размер
		|		ИНАЧЕ 0
		|	КОНЕЦ - ВЫБОР
		|		КОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер >= 0
		|			ТОГДА ЕСТЬNULL(ОблагаемаяБазаПрошлогоМесяца.ЗаГод, 0) - Предел.Размер
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК СуммаПревысившаяПредел
		|ПОМЕСТИТЬ ВТБазаПревышенияДохода
		|ИЗ
		|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредельнаяВеличина КАК Предел
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаНарастающимИтогом КАК ОблагаемаяБазаПрошлогоМесяца
		|		ПО ОблагаемаяБаза.ФизЛицо = ОблагаемаяБазаПрошлогоМесяца.ФизЛицо
		|			И (ОблагаемаяБаза.Период = ДОБАВИТЬКДАТЕ(ОблагаемаяБазаПрошлогоМесяца.Период, МЕСЯЦ, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|	СведенияОДоходах.ПериодРегистрации КАК Период,
		|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ТипДоговора,
		|	СУММА(СведенияОДоходах.ОблагаемаяБазаПФР) КАК ЗаМесяц
		|ПОМЕСТИТЬ ВТБазаЗаМесяцПоОбособленноеПодразделение
		|ИЗ
		|	ВТДоходыПоТарифам КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизЛицо,
		|	СведенияОДоходах.ОбособленноеПодразделение,
		|	СведенияОДоходах.ПериодРегистрации,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов,
		|	СведенияОДоходах.ТипДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|	СведенияОДоходах.Период КАК Период,
		|	МАКСИМУМ(СведенияОДоходах.ЗаМесяц) КАК ЗаМесяц
		|ПОМЕСТИТЬ ВТМаксБазаЗаМесяц
		|ИЗ
		|	ВТБазаЗаМесяцПоОбособленноеПодразделение КАК СведенияОДоходах
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизЛицо,
		|	СведенияОДоходах.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|	СведенияОДоходах.Период КАК Период,
		|	СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	МАКСИМУМ(БазаЗаМесяцПоОбособленным.ТипДоговора) КАК ТипДоговора
		|ПОМЕСТИТЬ ВТОбособленноеПодразделениеМаксБазы
		|ИЗ
		|	(ВЫБРАТЬ
		|		СведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|		СведенияОДоходах.Период КАК Период,
		|		СведенияОДоходах.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|		МАКСИМУМ(БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов) КАК ВидТарифаСтраховыхВзносов,
		|		БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЗаМесяц
		|	ИЗ
		|		(ВЫБРАТЬ
		|			СведенияОДоходах.ФизЛицо КАК ФизЛицо,
		|			СведенияОДоходах.Период КАК Период,
		|			СведенияОДоходах.ЗаМесяц КАК ЗаМесяц,
		|			МАКСИМУМ(БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение) КАК ОбособленноеПодразделение
		|		ИЗ
		|			ВТМаксБазаЗаМесяц КАК СведенияОДоходах
		|				ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
		|				ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
		|					И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
		|					И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
		|		
		|		СГРУППИРОВАТЬ ПО
		|			СведенияОДоходах.ФизЛицо,
		|			СведенияОДоходах.Период,
		|			СведенияОДоходах.ЗаМесяц) КАК СведенияОДоходах
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
		|			ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
		|				И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
		|				И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
		|				И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СведенияОДоходах.ФизЛицо,
		|		СведенияОДоходах.Период,
		|		СведенияОДоходах.ОбособленноеПодразделение,
		|		БазаЗаМесяцПоОбособленным.ЗаМесяц) КАК СведенияОДоходах
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
		|		ПО СведенияОДоходах.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
		|			И СведенияОДоходах.Период = БазаЗаМесяцПоОбособленным.Период
		|			И СведенияОДоходах.ЗаМесяц = БазаЗаМесяцПоОбособленным.ЗаМесяц
		|			И СведенияОДоходах.ОбособленноеПодразделение = БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	СведенияОДоходах.ФизЛицо,
		|	СведенияОДоходах.Период,
		|	СведенияОДоходах.ОбособленноеПодразделение,
		|	СведенияОДоходах.ВидТарифаСтраховыхВзносов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОблагаемаяБаза.ФизЛицо КАК ФизЛицо,
		|	ОблагаемаяБаза.Период КАК Период,
		|	ВЫБОР
		|		КОГДА ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел = 0
		|				ИЛИ ОблагаемаяБаза.ЗаМесяц = 0
		|			ТОГДА 0
		|		ИНАЧЕ ВЫРАЗИТЬ((ВЫРАЗИТЬ(ПревышениеДоходаПоВсемОП.СуммаПревысившаяПредел КАК ЧИСЛО(25, 10))) * (ВЫРАЗИТЬ(БазаЗаМесяцПоОбособленным.ЗаМесяц КАК ЧИСЛО(25, 10))) / (ВЫРАЗИТЬ(ОблагаемаяБаза.ЗаМесяц КАК ЧИСЛО(25, 10))) КАК ЧИСЛО(15, 2))
		|	КОНЕЦ КАК СуммаПревысившаяПредел,
		|	БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение,
		|	БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов,
		|	БазаЗаМесяцПоОбособленным.ТипДоговора
		|ПОМЕСТИТЬ ВТПревышениеДоходаПоОбособленноеПодразделение
		|ИЗ
		|	ВТБазаНарастающимИтогом КАК ОблагаемаяБаза
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаПревышенияДохода КАК ПревышениеДоходаПоВсемОП
		|		ПО ОблагаемаяБаза.ФизЛицо = ПревышениеДоходаПоВсемОП.ФизЛицо
		|			И ОблагаемаяБаза.Период = ПревышениеДоходаПоВсемОП.Период
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТБазаЗаМесяцПоОбособленноеПодразделение КАК БазаЗаМесяцПоОбособленным
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
		|			ПО БазаЗаМесяцПоОбособленным.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
		|				И БазаЗаМесяцПоОбособленным.Период = ОбособленноеПодразделениеДляОкругления.Период
		|				И БазаЗаМесяцПоОбособленным.ОбособленноеПодразделение = ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение
		|				И БазаЗаМесяцПоОбособленным.ВидТарифаСтраховыхВзносов = ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов
		|				И БазаЗаМесяцПоОбособленным.ТипДоговора = ОбособленноеПодразделениеДляОкругления.ТипДоговора
		|		ПО ОблагаемаяБаза.Период = БазаЗаМесяцПоОбособленным.Период
		|			И ОблагаемаяБаза.ФизЛицо = БазаЗаМесяцПоОбособленным.ФизЛицо
		|ГДЕ
		|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение ЕСТЬ NULL 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Превышение.ФизЛицо КАК ФизЛицо,
		|	Превышение.Период КАК Период,
		|	Превышение.СуммаПревысившаяПредел,
		|	Превышение.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	Превышение.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
		|	Превышение.ТипДоговора
		|ПОМЕСТИТЬ ВТПревышениеДохода
		|ИЗ
		|	ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Превышение.ФизЛицо,
		|	Превышение.Период,
		|	СУММА(Превышение.СуммаПревысившаяПредел),
		|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
		|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
		|	ОбособленноеПодразделениеДляОкругления.ТипДоговора
		|ИЗ
		|	(ВЫБРАТЬ
		|		Превышение.ФизЛицо КАК ФизЛицо,
		|		Превышение.Период КАК Период,
		|		-Превышение.СуммаПревысившаяПредел КАК СуммаПревысившаяПредел
		|	ИЗ
		|		ВТПревышениеДоходаПоОбособленноеПодразделение КАК Превышение
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		Превышение.ФизЛицо,
		|		Превышение.Период,
		|		Превышение.СуммаПревысившаяПредел
		|	ИЗ
		|		ВТБазаПревышенияДохода КАК Превышение) КАК Превышение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОбособленноеПодразделениеМаксБазы КАК ОбособленноеПодразделениеДляОкругления
		|		ПО Превышение.ФизЛицо = ОбособленноеПодразделениеДляОкругления.ФизЛицо
		|			И Превышение.Период = ОбособленноеПодразделениеДляОкругления.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	Превышение.ФизЛицо,
		|	Превышение.Период,
		|	ОбособленноеПодразделениеДляОкругления.ВидТарифаСтраховыхВзносов,
		|	ОбособленноеПодразделениеДляОкругления.ОбособленноеПодразделение,
		|	ОбособленноеПодразделениеДляОкругления.ТипДоговора
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоходыВзносов.ФизЛицо КАК ФизЛицо,
		|	ДоходыВзносов.ПериодРегистрации КАК Период,
		|	МЕСЯЦ(ДоходыВзносов.ПериодРегистрации) КАК Месяц,
		|	ДоходыВзносов.ВидТарифаСтраховыхВзносов КАК ВидТарифаСтраховыхВзносов,
		|	ДоходыВзносов.ТипДоговора,
		|	СУММА(ДоходыВзносов.Результат) КАК НачисленоВсего,
		|	СУММА(ДоходыВзносов.ОблагаемаяБазаПФР) - МАКСИМУМ(ПревышениеДоходаПФР.СуммаПревысившаяПредел) КАК ОблагаемаяБазаПФР
		|ПОМЕСТИТЬ ВТДоходыПоТарифамДоговорам
		|ИЗ
		|	ВТДоходыПоТарифам КАК ДоходыВзносов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПревышениеДохода КАК ПревышениеДоходаПФР
		|		ПО ДоходыВзносов.ФизЛицо = ПревышениеДоходаПФР.ФизЛицо
		|			И ДоходыВзносов.ОбособленноеПодразделение = ПревышениеДоходаПФР.ОбособленноеПодразделение
		|			И ДоходыВзносов.ПериодРегистрации = ПревышениеДоходаПФР.Период
		|			И ДоходыВзносов.ВидТарифаСтраховыхВзносов = ПревышениеДоходаПФР.ВидТарифаСтраховыхВзносов
		|			И ДоходыВзносов.ТипДоговора = ПревышениеДоходаПФР.ТипДоговора
		|ГДЕ
		|	ДоходыВзносов.ОбособленноеПодразделение = &ОбособленноеПодразделение
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоходыВзносов.ФизЛицо,
		|	ДоходыВзносов.ВидТарифаСтраховыхВзносов,
		|	ДоходыВзносов.ТипДоговора,
		|	ДоходыВзносов.ПериодРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Доходы.ФизЛицо.СтраховойНомерПФР = """"
		|			ТОГДА ИСТИНА
		|		КОГДА Доходы.ФизЛицо.СтраховойНомерПФР = ""   -   -      ""
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК НетСтраховогоНомера,
		|	Доходы.ФизЛицо КАК ФизЛицо,
		|	Доходы.ФизЛицо.СтраховойНомерПФР КАК СтраховойНомерПФР,
		|	Доходы.Месяц КАК Месяц,
		|	СУММА(Доходы.НачисленоВсего) КАК Заработок,
		|	СУММА(Доходы.ОблагаемаяБазаПФР) КАК ОблагаетсяВзносами,
		|	СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц КАК КатегорияЗастрахованныхЛиц,
		|	Доходы.ТипДоговора КАК ТипДоговора,
		|	Доходы.ФизЛицо.Наименование КАК Порядок,
		|	ФИО.Фамилия,
		|	ФИО.Имя,
		|	ФИО.Отчество
		|ИЗ
		|	ВТДоходыПоТарифамДоговорам КАК Доходы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФИО КАК ФИО
		|		ПО Доходы.ФизЛицо = ФИО.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСоответствиеТарифаКатегории КАК СоответствиеТарифаКатегории
		|		ПО Доходы.ВидТарифаСтраховыхВзносов = СоответствиеТарифаКатегории.ВидТарифаСтраховыхВзносов
		|			И (ГОД(Доходы.Период) МЕЖДУ СоответствиеТарифаКатегории.ГодС И СоответствиеТарифаКатегории.ГодПо)
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.ФизЛицо,
		|	Доходы.Месяц,
		|	СоответствиеТарифаКатегории.КатегорияЗастрахованныхЛиц,
		|	Доходы.ТипДоговора,
		|	Доходы.ФизЛицо.СтраховойНомерПФР,
		|	Доходы.ФизЛицо.Наименование,
		|	ФИО.Фамилия,
		|	ФИО.Имя,
		|	ФИО.Отчество
		|
		|УПОРЯДОЧИТЬ ПО
		|	КатегорияЗастрахованныхЛиц,
		|	ТипДоговора,
		|	Порядок,
		|	ФизЛицо,
		|	Месяц";
		
		Запрос.Текст = СтрЗаменить(ОсновнойТекст,"РегистрСведений.УчетнаяПолитикаНалоговыйУчет", ЗаполнениеРегламентированнойОтчетностиПереопределяемый.ИмяУчетнойПолитики()); 	
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("По организации " + ОбщегоНазначения.ПолучитьЗначениеРеквизита(Организация,"Наименование") + " не обнаружено сведений о заработке!", СтатусСообщения.ОченьВажное));
			ВывестиСообщенияОбОшибках(МассивСообщений);
			Возврат Неопределено
		КонецЕсли;
		
		Если ДатаСозданияДокументов < НачалоДня(ДатаПо) Тогда
			МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("При расчете сумм заработка учтены данные, зарегистрированные по " + Формат(ДатаСозданияДокументов,"ДЛФ=DD"), СтатусСообщения.Важное));
		КонецЕсли;
		
		СтруктураРеквизитов = СтруктураОбщихРеквизитовДокумента();
			
		Выборка = РезультатЗапроса.Выбрать();
		БылоСтрок = ПачкиСЗВ63.Количество();
		Пока Выборка.СледующийПоЗначениюПоля("КатегорияЗастрахованныхЛиц") Цикл
			Пока Выборка.СледующийПоЗначениюПоля("ТипДоговора") Цикл
				
				НовыйДок = СоздатьСЗВ63(СтруктураРеквизитов);
				ЗаполнитьЗначенияСвойств(НовыйДок,Выборка,"КатегорияЗастрахованныхЛиц,ТипДоговора");

				Пока Выборка.СледующийПоЗначениюПоля("Порядок") Цикл
					Пока Выборка.СледующийПоЗначениюПоля("ФизЛицо") Цикл
						
						// Если у физлица нет страхового номера, то в пачки его включать не будем: проверка на указание пустого или неверного страхового номера ("   -   -      ")
						Если Выборка.НетСтраховогоНомера Тогда
							СписокФизЛицБезСтрахНомеров.Добавить(Выборка.ФизЛицо, Выборка.Порядок);
							Продолжить;
						КонецЕсли;	
						
						Если НовыйДок.СотрудникиОрганизации.Количество() = 200 Тогда
							НовыйДок = СоздатьСЗВ63(СтруктураРеквизитов);
							ЗаполнитьЗначенияСвойств(НовыйДок, Выборка, "КатегорияЗастрахованныхЛиц,ТипДоговора");
						КонецЕсли; 
					
						СтрокаТабличнойЧасти = НовыйДок.СотрудникиОрганизации.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, Выборка);
						Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Фамилия + СтрокаТабличнойЧасти.Имя + СтрокаТабличнойЧасти.Отчество) Тогда
							Фамилия = ""; Имя = ""; Отчество = "";
							ОбщегоНазначения.ФамилияИнициалыФизЛица(Выборка.Порядок,Фамилия,Имя,Отчество);
							СтрокаТабличнойЧасти.Фамилия = Фамилия;
							СтрокаТабличнойЧасти.Имя = Имя;
							СтрокаТабличнойЧасти.Отчество = Отчество;
						КонецЕсли;
						
						Пока Выборка.Следующий() Цикл
							ЗаполнитьЗначенияСвойств(НовыйДок.СведенияОЗаработке.Добавить(), Выборка);
						КонецЦикла;
						
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		ТекущаяСтрока = ПачкиСЗВ63[БылоСтрок];
		
	КонецЕсли;
	
	Если СписокФизЛицБезСтрахНомеров.Количество() > 0 Тогда
		
		СтрСписокФизЛицБезСтрахНомеров = "";
		Для Каждого ЭлементСписка Из СписокФизЛицБезСтрахНомеров Цикл
			СтрСписокФизЛицБезСтрахНомеров = СтрСписокФизЛицБезСтрахНомеров + Символы.ПС + Символы.Таб + ЭлементСписка.Представление;
		КонецЦикла;
		МассивСообщений.Добавить(СоздатьСообщениеСтруктуру("Следующие физические лица не включены в пачки документов перс.учета из-за отсутствия страховых номеров ПФР:" + СтрСписокФизЛицБезСтрахНомеров, СтатусСообщения.Важное));
		
	КонецЕсли; 
	
	Если МассивСообщений.Количество() > 0 Тогда
		ВывестиСообщенияОбОшибках(МассивСообщений);
	КонецЕсли; 
	
	Возврат ТекущаяСтрока
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////

СоответствиеСсылокИОбъектов = Новый Соответствие;
